Autodesk.Revit.DB.PointClouds.CloudPoint.Color
The color

Autodesk.Revit.DB.PointClouds.CloudPoint.Z
The Z coordinate

Autodesk.Revit.DB.PointClouds.CloudPoint.Y
The Y coordinate

Autodesk.Revit.DB.PointClouds.CloudPoint.X
The X coordinate

Autodesk.Revit.DB.PointClouds.CloudPoint.op_Implicit(Autodesk.Revit.DB.PointClouds.CloudPoint)~Autodesk.Revit.DB.XYZ
Creates an XYZ object from this point cloud.

Autodesk.Revit.DB.PointClouds.CloudPoint.#ctor(System.Single,System.Single,System.Single,System.Int32)
Creates a new cloud point.
x: The X coordinate.
y: The Y coordinate.
z: The Z coordinate.
color: The color.

Autodesk.Revit.DB.PointClouds.CloudPoint
Represents a point obtained from a Point cloud.
Since: 2012